

// 1 RN屏幕的适配方案 以设计稿宽度750PX为例 
// 密度独立像素 density-independent pixels  DP
// 像素比   ratio_750 = windowWidth / 750;  按照设计稿 750PX宽度。 一个控件的宽80PX  80*像素比 得到实际的对应的宽度dp
// 分辨率 分辨率越高，屏幕里的像素点越多。如同一宽度。1920 和1280 表示在此宽度内包含1920个像素点。1280 就是1280个

// 参考
// https://www.cnblogs.com/best/p/17272814.html

// 2 unity 打包Android的方式
// 基本的安装Android项目SDK JDK NDK 记录安装路径。配置环境变量 还有注意不同版本的gradle 打包会出错。要适配对应版本

// 参考
// https://blog.csdn.net/crb114594/article/details/130809656

// 3 设计模式分类 23种和一些分类概念
//  创建型 5 工厂 抽象工厂 建造者 单例 原型
//  结构型 7 装饰器、代理、桥接、适配器、组合、外观、享元
//  行为型 11 策略、模板方法、命令、迭代器、观察者、仲裁者、备忘录、解析器、建造者、责任链、访问者

// 创建型
// 工厂 
// 抽象工厂 
// 建造者 
// 单例 
// 原型

// 结构型 7 
// 装饰器、
// 代理、
// 桥接、
// 适配器、
// 组合、
// 外观、
// 享元

//  行为型 11 
// 策略、
// 模板方法、
// 命令、
// 迭代器、
// 观察者、
// 仲裁者、
// 备忘录、
// 解析器、
// 建造者、
// 责任链、
// 访问者


// 设计模式的原则
// 单一，接口隔离，依赖反转，里式替代，开闭、迪米特法则、合成复用

// 参考 https://blog.csdn.net/guorui_java/article/details/104026988





















